app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if params[:back]
      render :new
    else
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "dfgvAZb"], ["created_at", "2022-12-15 01:03:11.028095"], ["updated_at", "2022-12-15 01:03:11.028095"]]